Note/SortingAlgorithmsRevisited.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-29 周三 20:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sorting Algorithms: revisited</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
</head>
<body>
<div id="content">
<h1 class="title">Sorting Algorithms: revisited</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb1535ef">1. Overview</a>
<ul>
<li><a href="#orgcb6deb2">1.1. Comparison-based sorting</a></li>
<li><a href="#orgf3dec51">1.2. Representation-based sorting</a></li>
</ul>
</li>
<li><a href="#orgaa82598">2. Algorithms in <i>Haskell</i></a>
<ul>
<li><a href="#orgce9ac05">2.1. Selection sort</a></li>
<li><a href="#org438f310">2.2. Insertion sort</a></li>
<li><a href="#org8311e3b">2.3. Quick sort</a></li>
<li><a href="#org4339c56">2.4. Merge sort</a></li>
<li><a href="#org75a3f67">2.5. Heap sort</a></li>
</ul>
</li>
<li><a href="#orgc9da54f">3. Algorithms in <i>Scala</i></a>
<ul>
<li><a href="#orgb527b5a">3.1. Selection sort</a>
<ul>
<li><a href="#orgada9945">3.1.1. Naive translation in Scala</a></li>
<li><a href="#org2e57cf6">3.1.2. Tailrec</a></li>
<li><a href="#org566f3b9">3.1.3. One-pass</a></li>
<li><a href="#org3e7f052">3.1.4. Dynamic Programming</a></li>
<li><a href="#org7e2132a">3.1.5. Optimizations summary</a></li>
<li><a href="#orgb110004">3.1.6. Applying our optimizations</a></li>
</ul>
</li>
<li><a href="#org4022953">3.2. Insertion sort</a></li>
</ul>
</li>
<li><a href="#orgc0fc3da">4. Algorithms in <i>C++</i></a>
<ul>
<li><a href="#orgd812653">4.1. Selection sort</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
We're going to revisite some main-stream sorting algorithms and
try to implement them in a more efficient way.
</p>

<p>
To make things simple, we choose <span class="underline">Haskell</span> to describe basic recursions and
ideas, then we directly translate haskell codes into <span class="underline">Scala</span> since Scala serves
a great role between purely functional way and more traditional ways.
</p>

<p>
Finally, we translate Scala codes into <span class="underline">C++</span> (some even C:).
If you have some better ideas or implementations, please email <span class="underline">comcx@outlook.com</span>.
</p>

<ul class="org-ul">
<li>Our outline</li>
</ul>
<pre class="example">
Haskell recursion                    ==&gt; 
Scala equivalent                     ==&gt; 
Scala more traditional and efficient ==&gt;
C++ implementation                  (==&gt; C)
</pre>
<p>
Let's go!
</p>

<div id="outline-container-orgb1535ef" class="outline-2">
<h2 id="orgb1535ef"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcb6deb2" class="outline-3">
<h3 id="orgcb6deb2"><span class="section-number-3">1.1</span> Comparison-based sorting</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A Haskell blueprint of comparison-based sorting is
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">sort</span> <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">Ord</span> a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span>
</pre>
</div>

<p>
Nearly all comparison-based algorithms rely on the following principles:
</p>
<ol class="org-ol">
<li>Split the list <code>L</code> into two lists <code>L1</code> and <code>L2</code>, sort them resursively.</li>
<li>Join the result together.</li>
</ol>

<p>
From these principles, we have the following table:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Singleton</th>
<th scope="col" class="org-left">Equal size</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">hard split/easy join</td>
<td class="org-left">Selection sort</td>
<td class="org-left">Quick sort</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Heap sort</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">easy split/hard join</td>
<td class="org-left">Insertion sort</td>
<td class="org-left">Merge sort</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Tree sort</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
where <code>Singleton/Equal size</code> refers the length of <code>L1</code> compared to <code>L2</code>.
</p>

<ul class="org-ul">
<li>Visualization</li>
</ul>
<pre class="example">
                           List L
                             ||
                             \/
                           split L 
                    /                   \
          sort L1                           sort L2
                   \                    /
                         join L1 L2
                             ||
                             \/
                        Sorted List L
</pre>
<p>
Ok, now let's try to implement these algorithms in <code>Haskell</code>.
</p>
</div>
</div>

<div id="outline-container-orgf3dec51" class="outline-3">
<h3 id="orgf3dec51"><span class="section-number-3">1.2</span> Representation-based sorting</h3>
</div>
</div>

<div id="outline-container-orgaa82598" class="outline-2">
<h2 id="orgaa82598"><span class="section-number-2">2</span> Algorithms in <i>Haskell</i></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgce9ac05" class="outline-3">
<h3 id="orgce9ac05"><span class="section-number-3">2.1</span> Selection sort</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><b>A naive implementation</b></li>
</ul>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">ssort</span> <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">Ord</span> a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span>
<span style="color: #edd400; font-weight: bold;">ssort</span> <span style="color: #ffd700; font-weight: bold;">[]</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700; font-weight: bold;">[]</span>
<span style="color: #edd400; font-weight: bold;">ssort</span> xs <span style="color: #ff6347; font-weight: bold;">=</span> m <span style="color: #8ae234; font-weight: bold;">:</span> ssort <span style="color: #ff6347; font-weight: bold;">$</span> delete m xs
  <span style="color: #729fcf; font-weight: bold;">where</span> m <span style="color: #ff6347; font-weight: bold;">=</span> minimum xs
</pre>
</div>
<p>
Well although this is not efficient, 
this is quite clear and easy to understand.
</p>

<p>
A more efficient implemetation of Haskell maybe:
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">split</span> <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">Ord</span> a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">-&gt;</span> a <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span>
<span style="color: #edd400; font-weight: bold;">split</span> <span style="color: #ffd700; font-weight: bold;">[]</span> m r     <span style="color: #ff6347; font-weight: bold;">=</span> m <span style="color: #8ae234; font-weight: bold;">:</span> ssort' r
<span style="color: #edd400; font-weight: bold;">split</span> <span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #ffd700;">)</span> m r <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">&lt;</span> m     <span style="color: #ff6347; font-weight: bold;">=</span> split xs x <span style="color: #ffd700;">(</span>m<span style="color: #8ae234; font-weight: bold;">:</span>r<span style="color: #ffd700;">)</span>
                 <span style="color: #ff6347; font-weight: bold;">|</span> otherwise <span style="color: #ff6347; font-weight: bold;">=</span> split xs m <span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>r<span style="color: #ffd700;">)</span>

<span style="color: #edd400; font-weight: bold;">ssort'</span> <span style="color: #ffd700; font-weight: bold;">[]</span>     <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700; font-weight: bold;">[]</span>
<span style="color: #edd400; font-weight: bold;">ssort'</span> <span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> split xs x <span style="color: #ffd700; font-weight: bold;">[]</span>
</pre>
</div>
<p>
or just make the naive one <i>tailrec</i>.
</p>

<p>
However, this way it's not as clear as the naive one.
</p>
</div>
</div>

<div id="outline-container-org438f310" class="outline-3">
<h3 id="org438f310"><span class="section-number-3">2.2</span> Insertion sort</h3>
<div class="outline-text-3" id="text-2-2">
<p>
This algorithm is ubiquitous in our daily lives.
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">insert</span> k <span style="color: #ffd700; font-weight: bold;">[]</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700;">[</span>k<span style="color: #ffd700;">]</span>
<span style="color: #edd400; font-weight: bold;">insert</span> k l<span style="color: #ff6347; font-weight: bold;">@</span><span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> k <span style="color: #ff6347; font-weight: bold;">&lt;=</span> x    <span style="color: #ff6347; font-weight: bold;">=</span> k <span style="color: #8ae234; font-weight: bold;">:</span> l
  <span style="color: #ff6347; font-weight: bold;">|</span> otherwise <span style="color: #ff6347; font-weight: bold;">=</span> x <span style="color: #8ae234; font-weight: bold;">:</span> <span style="color: #ffd700;">(</span>insert k xs<span style="color: #ffd700;">)</span>

<span style="color: #edd400; font-weight: bold;">isort</span> <span style="color: #ff6347; font-weight: bold;">=</span> foldr insert <span style="color: #ffd700; font-weight: bold;">[]</span>
</pre>
</div>
</div>
</div>
