Note/SortingAlgorithmsRevisited.org
*** Quick sort
Quick sort well, is famous...
many people was attracted by the naive implementation in haskell...
#+BEGIN_SRC haskell

qsort :: ord a => [a] -> [a]
qsort [] = []
qsort (x:xs) = qsort lower ++ [x] ++ qsort upper
  where lower = [e | e <- xs, e <= x]
        upper = [e | e <- xs, e >  x]
#+END_SRC

Well, just improve a little bit(tailrec):
#+BEGIN_SRC haskell

qsort' [] s     = s
qsort' (x:xs) s = qsort' lower (x : qsort' upper s)
  where lower = [e | e <- xs, e <= x]
        upper = [e | e <- xs, e >  x]
#+END_SRC

We can also split the list in fewer passes, but I think it's not necessary.

*** Merge sort
Merge sort is a well balanced algorithm.

Firstly, we need to know how to merge two ordered lists.
#+BEGIN_SRC haskell

merge :: Ord a => [a] -> [a] -> [a]
merge [] b = b
merge a [] = a
merge a@(x:xs) b@(y:ys)
  | x <= y    = x : merge xs b
  | otherwise = y : merge a ys
#+END_SRC

Now all we need is to split list in a balanced way.
#+BEGIN_SRC haskell

msort :: Ord a => [a] -> [a]
msort []  = []
msort [x] = [x]
msort xs  = merge (msort as) (msort bs)
  where as = take k xs
        bs = drop k xs
        k  = (length xs) `div` 2
#+END_SRC

*** Heap sort
#+BEGIN_SRC 
UNDERWORK!
#+END_SRC


** Algorithms in /Scala/ 
In this part, we firstly translate haskell code directly into Scala
and then try to improve codes to a more traditional program.

At first, we will try to be as functional as possible, every variable should
not be changed. However, scala also support traditional variables which can
be easily changed. We will implement both versions.

*** Selection sort
**** Naive translation in Scala
#+BEGIN_SRC scala

object SelectionSort {

  def remove[A](x: A, list: List[A]) = list diff List(x)

  //Functional version 1
  def ssort1[A <% Ordered[A]](xs: List[A]): List[A] = xs match {
    case Nil => Nil
    case _   => xs.min :: ssort1(xs remove xs.min)
  }
}
#+END_SRC
Well, before we get into more traditional ways of Selection sort,
Let's try our best to optimize our functional version.

We mainly apply three optimizations: *tailrec* , *one-pass* and *Dynamic programming*.

