Note/SortingAlgorithmsRevisited.html

<div id="outline-container-org8311e3b" class="outline-3">
<h3 id="org8311e3b"><span class="section-number-3">2.3</span> Quick sort</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Quick sort well, is famous&#x2026;
many people was attracted by the naive implementation in haskell&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">qsort</span> <span style="color: #ff6347; font-weight: bold;">::</span> ord a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span>
<span style="color: #edd400; font-weight: bold;">qsort</span> <span style="color: #ffd700; font-weight: bold;">[]</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700; font-weight: bold;">[]</span>
<span style="color: #edd400; font-weight: bold;">qsort</span> <span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> qsort lower <span style="color: #ff6347; font-weight: bold;">++</span> <span style="color: #ffd700;">[</span>x<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">++</span> qsort upper
  <span style="color: #729fcf; font-weight: bold;">where</span> lower <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700;">[</span>e <span style="color: #ff6347; font-weight: bold;">|</span> e <span style="color: #ff6347; font-weight: bold;">&lt;-</span> xs, e <span style="color: #ff6347; font-weight: bold;">&lt;=</span> x<span style="color: #ffd700;">]</span>
        upper <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700;">[</span>e <span style="color: #ff6347; font-weight: bold;">|</span> e <span style="color: #ff6347; font-weight: bold;">&lt;-</span> xs, e <span style="color: #ff6347; font-weight: bold;">&gt;</span>  x<span style="color: #ffd700;">]</span>
</pre>
</div>

<p>
Well, just improve a little bit(tailrec):
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">qsort'</span> <span style="color: #ffd700; font-weight: bold;">[]</span> s     <span style="color: #ff6347; font-weight: bold;">=</span> s
<span style="color: #edd400; font-weight: bold;">qsort'</span> <span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #ffd700;">)</span> s <span style="color: #ff6347; font-weight: bold;">=</span> qsort' lower <span style="color: #ffd700;">(</span>x <span style="color: #8ae234; font-weight: bold;">:</span> qsort' upper s<span style="color: #ffd700;">)</span>
  <span style="color: #729fcf; font-weight: bold;">where</span> lower <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700;">[</span>e <span style="color: #ff6347; font-weight: bold;">|</span> e <span style="color: #ff6347; font-weight: bold;">&lt;-</span> xs, e <span style="color: #ff6347; font-weight: bold;">&lt;=</span> x<span style="color: #ffd700;">]</span>
        upper <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700;">[</span>e <span style="color: #ff6347; font-weight: bold;">|</span> e <span style="color: #ff6347; font-weight: bold;">&lt;-</span> xs, e <span style="color: #ff6347; font-weight: bold;">&gt;</span>  x<span style="color: #ffd700;">]</span>
</pre>
</div>

<p>
We can also split the list in fewer passes, but I think it's not necessary.
</p>
</div>
</div>

<div id="outline-container-org4339c56" class="outline-3">
<h3 id="org4339c56"><span class="section-number-3">2.4</span> Merge sort</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Merge sort is a well balanced algorithm.
</p>

<p>
Firstly, we need to know how to merge two ordered lists.
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">merge</span> <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">Ord</span> a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span>
<span style="color: #edd400; font-weight: bold;">merge</span> <span style="color: #ffd700; font-weight: bold;">[]</span> b <span style="color: #ff6347; font-weight: bold;">=</span> b
<span style="color: #edd400; font-weight: bold;">merge</span> a <span style="color: #ffd700; font-weight: bold;">[]</span> <span style="color: #ff6347; font-weight: bold;">=</span> a
<span style="color: #edd400; font-weight: bold;">merge</span> a<span style="color: #ff6347; font-weight: bold;">@</span><span style="color: #ffd700;">(</span>x<span style="color: #8ae234; font-weight: bold;">:</span>xs<span style="color: #ffd700;">)</span> b<span style="color: #ff6347; font-weight: bold;">@</span><span style="color: #ffd700;">(</span>y<span style="color: #8ae234; font-weight: bold;">:</span>ys<span style="color: #ffd700;">)</span>
  <span style="color: #ff6347; font-weight: bold;">|</span> x <span style="color: #ff6347; font-weight: bold;">&lt;=</span> y    <span style="color: #ff6347; font-weight: bold;">=</span> x <span style="color: #8ae234; font-weight: bold;">:</span> merge xs b
  <span style="color: #ff6347; font-weight: bold;">|</span> otherwise <span style="color: #ff6347; font-weight: bold;">=</span> y <span style="color: #8ae234; font-weight: bold;">:</span> merge a ys
</pre>
</div>

<p>
Now all we need is to split list in a balanced way.
</p>
<div class="org-src-container">
<pre class="src src-haskell">
<span style="color: #edd400; font-weight: bold;">msort</span> <span style="color: #ff6347; font-weight: bold;">::</span> <span style="color: #8ae234; font-weight: bold;">Ord</span> a <span style="color: #ff6347; font-weight: bold;">=&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">-&gt;</span> <span style="color: #ffd700;">[</span>a<span style="color: #ffd700;">]</span>
<span style="color: #edd400; font-weight: bold;">msort</span> <span style="color: #ffd700; font-weight: bold;">[]</span>  <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700; font-weight: bold;">[]</span>
<span style="color: #edd400; font-weight: bold;">msort</span> <span style="color: #ffd700;">[</span>x<span style="color: #ffd700;">]</span> <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700;">[</span>x<span style="color: #ffd700;">]</span>
<span style="color: #edd400; font-weight: bold;">msort</span> xs  <span style="color: #ff6347; font-weight: bold;">=</span> merge <span style="color: #ffd700;">(</span>msort as<span style="color: #ffd700;">)</span> <span style="color: #ffd700;">(</span>msort bs<span style="color: #ffd700;">)</span>
  <span style="color: #729fcf; font-weight: bold;">where</span> as <span style="color: #ff6347; font-weight: bold;">=</span> take k xs
        bs <span style="color: #ff6347; font-weight: bold;">=</span> drop k xs
        k  <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700;">(</span>length xs<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">`div`</span> 2
</pre>
</div>
</div>
</div>

<div id="outline-container-org75a3f67" class="outline-3">
<h3 id="org75a3f67"><span class="section-number-3">2.5</span> Heap sort</h3>
<div class="outline-text-3" id="text-2-5">
<pre class="example">
UNDERWORK!
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc9da54f" class="outline-2">
<h2 id="orgc9da54f"><span class="section-number-2">3</span> Algorithms in <i>Scala</i></h2>
<div class="outline-text-2" id="text-3">
<p>
In this part, we firstly translate haskell code directly into Scala
and then try to improve codes to a more traditional program.
</p>

<p>
At first, we will try to be as functional as possible, every variable should
not be changed. However, scala also support traditional variables which can
be easily changed. We will implement both versions.
</p>
</div>

<div id="outline-container-orgb527b5a" class="outline-3">
<h3 id="orgb527b5a"><span class="section-number-3">3.1</span> Selection sort</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgada9945" class="outline-4">
<h4 id="orgada9945"><span class="section-number-4">3.1.1</span> Naive translation in Scala</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-scala">
<span style="color: #729fcf; font-weight: bold;">object</span> <span style="color: #8ae234; font-weight: bold;">SelectionSort</span> <span style="color: #ffd700;">{</span>

  <span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #edd400; font-weight: bold;">remove</span><span style="color: #00bfff;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #00bfff;">](</span>x<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">A</span>, list<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ffa500;">]</span><span style="color: #00bfff;">)</span> <span style="color: #729fcf; font-weight: bold;">=</span> list diff <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #00bfff;">(</span>x<span style="color: #00bfff;">)</span>

  <span style="color: #888a85; font-style: italic;">//</span><span style="color: #888a85; font-style: italic;">Functional version 1</span>
  <span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #edd400; font-weight: bold;">ssort1</span><span style="color: #00bfff;">[</span><span style="color: #8ae234; font-weight: bold;">A</span> <span style="color: #729fcf; font-weight: bold;">&lt;%</span> <span style="color: #8ae234; font-weight: bold;">Ordered</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ffa500;">]</span><span style="color: #00bfff;">](</span>xs<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ffa500;">]</span><span style="color: #00bfff;">)</span><span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #00bfff;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #00bfff;">]</span> <span style="color: #729fcf; font-weight: bold;">=</span> xs <span style="color: #729fcf; font-weight: bold;">match</span> <span style="color: #00bfff;">{</span>
    <span style="color: #729fcf; font-weight: bold;">case</span> <span style="color: #8ae234; font-weight: bold;">Nil</span> <span style="color: #729fcf; font-weight: bold;">=&gt;</span> <span style="color: #8ae234; font-weight: bold;">Nil</span>
    <span style="color: #729fcf; font-weight: bold;">case</span> <span style="color: #729fcf; font-weight: bold;">_</span>   <span style="color: #729fcf; font-weight: bold;">=&gt;</span> xs.min :: ssort1<span style="color: #ffa500;">(</span>xs remove xs.min<span style="color: #ffa500;">)</span>
  <span style="color: #00bfff;">}</span>
<span style="color: #ffd700;">}</span>
</pre>
</div>
<p>
Well, before we get into more traditional ways of Selection sort,
Let's try our best to optimize our functional version.
</p>

<p>
We mainly apply three optimizations: <b>tailrec</b> , <b>one-pass</b> and <b>Dynamic programming</b>.
</p>
</div>
</div>
