Note/SortingAlgorithmsRevisited.html

<div id="outline-container-org2e57cf6" class="outline-4">
<h4 id="org2e57cf6"><span class="section-number-4">3.1.2</span> Tailrec</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
The <b>tailrec</b> optimization is efficient and crucial for our further
traditional implementations. However, how do we do tailrecs?
</p>

<ul class="org-ul">
<li><b>Simple list tailrec</b></li>
</ul>

<p>
To make things simple and stupid, we firstly only focus on recursions whose
last expression only contains one recursion
(which means we do not discuss tree recursion right now).
</p>

<pre class="example">
rec 1 = some value
rec x = f x (rec (h x))
</pre>

<p>
Now we unfold this recursion:
</p>
<pre class="example">
rec x = f x $ f (h x) $ f (h $ h x) $ f (h $ h $ h x) $ ... $ f (h $ h $ ... $ h $ x) $ (some value)
</pre>

<p>
Hummmmm, it looks even more complex&#x2026;
I now have two guesses on how to do tailrec for codes like this:
</p>
<ol class="org-ol">
<li>Build from bottom or reverse order</li>
<li>Do <i>CPS</i> transformation</li>
</ol>

<p>
Let's try the first one first.
To build from bottom, we need to know the most important parameter: <code>(h $ h $ ... $ x)</code>.
To know this parameter, we need to know how many times the function <code>h</code> was
applied to <code>x</code>. We can find some clues from the terminating pattern of <code>rec</code>.
</p>
</div>


<ol class="org-ol">
<li><a id="org759c7bc"></a>Reverse order<br />
<div class="outline-text-5" id="text-3-1-2-1">
<ul class="org-ul">
<li><p>
Our current problem:
</p>

<pre class="example">
  We have a function (h :: a -&gt; a) which do transformations of x and
  we need to figure out that how many times h applied to x in order to
  reach the value '1'(some constant or pattern) in the terminating definiton of rec.
</pre>

<ul class="org-ul">
<li><p>
If h is reversible(noted h', i.e. h . h' = id)
</p>

<p>
we can build from bottom!
Notice that we need to pass our value of each layer to upper layer,
so we need one more parameter to record our current result.
</p>
<pre class="example">
    reverseBuild f h x res = f x res
    reverseBuild f h y res = reverseBuild f h (h' y) (f y res)
</pre>
<ul class="org-ul">
<li>use foldl, foldr?</li>
</ul></li>
</ul></li>
</ul>


<ul class="org-ul">
<li><p>
else h is not reversible:(
</p>

<p>
well, which means we can't get results from bottom, we have to start from
head since we can not calculate (h $ h $ &#x2026; $ x). Maybe we need another strategy.
</p></li>
</ul>


<ul class="org-ul">
<li><p>
To change order&#x2026; How about <code>Monoid</code>?
</p>

<p>
Suppose we want to get the sum of a list:
</p>
<pre class="example">
    sum [] = 0
    sum (x:xs) = x + sum xs
</pre>
<p>
where, <code>(+)</code> becomes the function <code>f</code>.
</p>

<p>
Since (a + b) + c <code>=</code> a + (b + c),
we can reverse the calculation order
</p>
<pre class="example">
    a + (b + (c + d))
</pre>
<p>
to
</p>
<pre class="example">
    ((a + b) + c) + d
</pre>
<p>
It's just like to say that, we can change the calculation of
</p>
<pre class="example">
    x (h x) (h $ h x) ... (h $ h $ ... $ h x)
</pre>
<p>
with <code>f</code>.
</p>

<p>
Let's try to implement this transformation with our general code:
</p>
<pre class="example">
    reverseOrder f h 1 res = res
    reverseOrder f h x res = reverseOrder f h (h x) (f x (h x))
</pre>
<p>
This time we don't need <code>h'</code>!
</p></li>
</ul>


<ul class="org-ul">
<li><p>
Being inspired by monoid, maybe be we can again generize our 'monoid approach' a little bit
</p>

<p>
This time instead of requiring f to be satisfiled by monoid law,
we ourselves try to find a function <code>g</code> which satisfy the following law:
</p>
<pre class="example">
    g (g a b) c = f a (f b c)
</pre>
<p>
Now we can use our trick again:
</p>
<pre class="example">
    reverseOrder' g h 1 res = res
    reverseOrder' g h x res = reverseOrder' g h (g x) (g x (h x))
</pre></li>
</ul>


<ul class="org-ul">
<li><p>
Well, if we're not lucky.. we can't find a reverse h' nor monoid structure&#x2026;
</p>

<p>
Two options:
</p>
<ol class="org-ol">
<li>We still calculate from the beginning, but we pass the result as a <code>List</code> of (h $ ..x)s.
But this is not efficient and ugly&#x2026;</li>
<li>Maybe it's time for our <i>CPS</i> approach&#x2026;</li>
</ol></li>
</ul>


<p>
Time for the second idea!
</p>
</div>
</li>
<li><a id="orge3c87b9"></a>CPS trasformation<br />
<div class="outline-text-5" id="text-3-1-2-2">
<p>
CPS is a tool to convert recursive code to <b>tail call</b>.(note that this is different from tailrec).
Recall our <code>rec</code> function:
</p>
<pre class="example">
rec 1 = some value
rec x = f x (rec (h x))
</pre>

<p>
to <i>CPS</i> style =&gt;
</p>
<pre class="example">
rec 1 c = c value
rec x c = rec (h x) (c . (f x))
</pre>
<p>
It looks like we are just building our unfolded function chain.
Instead of accumulating results and values, we accumulate calculations(functions).
</p>

<p>
In fact, CPS can be used to convert any recursive function to tail-call form.
With CPS, we can build our executing stack from heap.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org566f3b9" class="outline-4">
<h4 id="org566f3b9"><span class="section-number-4">3.1.3</span> One-pass</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Well, notice that we need to traverse the list two times:
</p>
<ol class="org-ol">
<li>find minimum and</li>
<li>recursion.</li>
</ol>

<p>
We can optimize by <i>one-pass</i> just like the version in <i>Haskell</i>.
But this is not so necessary for us to translate codes to traditinal codes.
</p>
</div>
</div>

<div id="outline-container-org3e7f052" class="outline-4">
<h4 id="org3e7f052"><span class="section-number-4">3.1.4</span> Dynamic Programming</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Well, for recursions like list recursions, dynamic programming is not
quite necessary since we usually don't have too many overlapping sub-problems.
</p>

<p>
However, just in case, I think that if necessary, we can use lazy evaluation
and stream to do dynamic programming elegantly.
</p>

<p>
For more dynamic programming techniques, we will discuss in later parts(tree recursions).
</p>
</div>
</div>

<div id="outline-container-org7e2132a" class="outline-4">
<h4 id="org7e2132a"><span class="section-number-4">3.1.5</span> Optimizations summary</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
We have discussed several optimizations may be applied to list recursions.
Let's recap!
</p>
</div>

<ol class="org-ol">
<li><a id="org94b6e51"></a>Tailrec<br />
<ol class="org-ol">
<li><a id="orgec7b16d"></a>Reverse calculation order<br />
<div class="outline-text-6" id="text-3-1-5-1-1">
<ul class="org-ul">
<li>By reversible function or special function</li>
<li>By Monoid structure</li>
</ul>
</div>
</li>
<li><a id="org37426d9"></a>CPS transformation<br /></li>
</ol>
</li>

<li><a id="org22c998d"></a>Dynamic Programming<br />
<div class="outline-text-5" id="text-3-1-5-2">
<p>
To avoid unnecessary calculation
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgb110004" class="outline-4">
<h4 id="orgb110004"><span class="section-number-4">3.1.6</span> Applying our optimizations</h4>
<div class="outline-text-4" id="text-3-1-6">
</div>
<ol class="org-ol">
<li><a id="org40e797b"></a>Choose optimizing strategy<br />
<div class="outline-text-5" id="text-3-1-6-1">
<p>
Now we try to optimize our <span class="underline">selection sort</span>.
</p>

<ul class="org-ul">
<li><p>
What is function <code>h</code> ?
</p>

<pre class="example">
  h xs = delete xs (minimum xs)
</pre></li>

<li><p>
What is function <code>f</code> ?
</p>

<pre class="example">
  f x xs = (minimum x) : xs
</pre></li>

<li><p>
Is function <code>h</code> reversible?
</p>

<p>
well, obviously we can't. Since we can't recover a list from [].
</p></li>

<li><p>
Can we find a monoid structure?
</p>

<p>
No again. 
</p>
<pre class="example">
  f a (f b c) =/= f (f a b) c
</pre>
<p>
This can be verified easily.
</p></li>

<li><p>
Can we find a special function <code>g</code> to reverse calculation order?
</p>

<p>
Recall that function <code>g</code> must satisfy:
</p>
<pre class="example">
  g (g a b) c = f a (f b c)
</pre>
<p>
This looks a little hard though&#x2026;
</p>

<p>
A possible solution:
</p>
<pre class="example">
  g a xs = a ++ minimum xs
</pre></li>

<li>CPS style?
Yes.</li>
</ul>
</div>
</li>
