Note/SortingAlgorithmsRevisited.org
*****  Let's do it!
#+BEGIN_SRC scala

object SelectionSort {

  /**
   * calculates the minimum of a list and 
   * returns the list with that element removed
   */
  def minimum[A <% Ordered[A]](xs: List[A]): List[A] =
    (List(xs.head) /: xs.tail) {
      (ys, x) =>
        if(x < ys.head) x :: ys
        else ys.head :: x :: ys.tail
  }
  
  /**
   * Functional version 2(tailrec version)
   */
  def ssort2[A <% Ordered[A]](xs: List[A]): List[A] = {
    @tailrec
    def ssort2T[A <% Ordered[A]](xs: List[A], a: List[A]): List[A] = 
      if(xs.isEmpty) a 
      else ssort2T(minimum(xs), a ::: List(xs.min))
      
    ssort2T(xs, Nil) 
  }

  /**
   * CPS version
   */
  def ssort3[A <% Ordered[A]](xs: List[A]): List[A] = {
    
    @tailrec
    def ssort3T[A <% Ordered[A]](xs: List[A], a: List[A] => List[A]) = 
      if(xs.isEmpty) a(xs)
      else ssort3T(minimum(xs), (ys: List[A]) => xs.min :: ys)
  }
  

}
#+END_SRC

Realize that we need some tools to test the efficiency of our codes.


*** Insertion sort

** Algorithms in /C++/ 
*** Selection sort
Since we have get tailrec form, we can easily convert the algorithm into loops.




