Note/SortingAlgorithmsRevisited.html

<li><a id="org2b1179d"></a>Let's do it!<br />
<div class="outline-text-5" id="text-3-1-6-2">
<div class="org-src-container">
<pre class="src src-scala">
<span style="color: #729fcf; font-weight: bold;">object</span> <span style="color: #8ae234; font-weight: bold;">SelectionSort</span> <span style="color: #ffd700;">{</span>

  <span style="color: #888a85;">/**</span>
<span style="color: #888a85;">   * calculates the minimum of a list and </span>
<span style="color: #888a85;">   * returns the list with that element removed</span>
<span style="color: #888a85;">   */</span>
  <span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #edd400; font-weight: bold;">minimum</span><span style="color: #00bfff;">[</span><span style="color: #8ae234; font-weight: bold;">A</span> <span style="color: #729fcf; font-weight: bold;">&lt;%</span> <span style="color: #8ae234; font-weight: bold;">Ordered</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ffa500;">]</span><span style="color: #00bfff;">](</span>xs<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ffa500;">]</span><span style="color: #00bfff;">)</span><span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #00bfff;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #00bfff;">]</span> <span style="color: #729fcf; font-weight: bold;">=</span>
    <span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ffa500;">(</span>xs.head<span style="color: #ffa500;">)</span> /: xs.tail<span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
      <span style="color: #ffa500;">(</span>ys, x<span style="color: #ffa500;">)</span> <span style="color: #729fcf; font-weight: bold;">=&gt;</span>
        <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ffa500;">(</span>x &lt; ys.head<span style="color: #ffa500;">)</span> x :: ys
        <span style="color: #729fcf; font-weight: bold;">else</span> ys.head :: x :: ys.tail
  <span style="color: #00bfff;">}</span>
  
  <span style="color: #888a85;">/**</span>
<span style="color: #888a85;">   * Functional version 2(tailrec version)</span>
<span style="color: #888a85;">   */</span>
  <span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #edd400; font-weight: bold;">ssort2</span><span style="color: #00bfff;">[</span><span style="color: #8ae234; font-weight: bold;">A</span> <span style="color: #729fcf; font-weight: bold;">&lt;%</span> <span style="color: #8ae234; font-weight: bold;">Ordered</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ffa500;">]</span><span style="color: #00bfff;">](</span>xs<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ffa500;">]</span><span style="color: #00bfff;">)</span><span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #00bfff;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #00bfff;">]</span> <span style="color: #729fcf; font-weight: bold;">=</span> <span style="color: #00bfff;">{</span>
    <span style="color: #729fcf;">@tailrec</span>
    <span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #edd400; font-weight: bold;">ssort2T</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span> <span style="color: #729fcf; font-weight: bold;">&lt;%</span> <span style="color: #8ae234; font-weight: bold;">Ordered</span><span style="color: #ff7f50;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ff7f50;">]</span><span style="color: #ffa500;">](</span>xs<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ff7f50;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ff7f50;">]</span>, a<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ff7f50;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ff7f50;">]</span><span style="color: #ffa500;">)</span><span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ffa500;">]</span> <span style="color: #729fcf; font-weight: bold;">=</span> 
      <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ffa500;">(</span>xs.isEmpty<span style="color: #ffa500;">)</span> a 
      <span style="color: #729fcf; font-weight: bold;">else</span> ssort2T<span style="color: #ffa500;">(</span>minimum<span style="color: #ff7f50;">(</span>xs<span style="color: #ff7f50;">)</span>, a ::: <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ff7f50;">(</span>xs.min<span style="color: #ff7f50;">)</span><span style="color: #ffa500;">)</span>
      
    ssort2T<span style="color: #ffa500;">(</span>xs, <span style="color: #8ae234; font-weight: bold;">Nil</span><span style="color: #ffa500;">)</span> 
  <span style="color: #00bfff;">}</span>

  <span style="color: #888a85;">/**</span>
<span style="color: #888a85;">   * CPS version</span>
<span style="color: #888a85;">   */</span>
  <span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #edd400; font-weight: bold;">ssort3</span><span style="color: #00bfff;">[</span><span style="color: #8ae234; font-weight: bold;">A</span> <span style="color: #729fcf; font-weight: bold;">&lt;%</span> <span style="color: #8ae234; font-weight: bold;">Ordered</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ffa500;">]</span><span style="color: #00bfff;">](</span>xs<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ffa500;">]</span><span style="color: #00bfff;">)</span><span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #00bfff;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #00bfff;">]</span> <span style="color: #729fcf; font-weight: bold;">=</span> <span style="color: #00bfff;">{</span>
    
    <span style="color: #729fcf;">@tailrec</span>
    <span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #edd400; font-weight: bold;">ssort3T</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">A</span> <span style="color: #729fcf; font-weight: bold;">&lt;%</span> <span style="color: #8ae234; font-weight: bold;">Ordered</span><span style="color: #ff7f50;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ff7f50;">]</span><span style="color: #ffa500;">](</span>xs<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ff7f50;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ff7f50;">]</span>, a<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ff7f50;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ff7f50;">]</span> <span style="color: #729fcf; font-weight: bold;">=&gt;</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ff7f50;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #ff7f50;">]</span><span style="color: #ffa500;">)</span> <span style="color: #729fcf; font-weight: bold;">=</span> 
      <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ffa500;">(</span>xs.isEmpty<span style="color: #ffa500;">)</span> a<span style="color: #ffa500;">(</span>xs<span style="color: #ffa500;">)</span>
      <span style="color: #729fcf; font-weight: bold;">else</span> ssort3T<span style="color: #ffa500;">(</span>minimum<span style="color: #ff7f50;">(</span>xs<span style="color: #ff7f50;">)</span>, <span style="color: #ff7f50;">(</span>ys<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #00ff00;">[</span><span style="color: #8ae234; font-weight: bold;">A</span><span style="color: #00ff00;">]</span><span style="color: #ff7f50;">)</span> <span style="color: #729fcf; font-weight: bold;">=&gt;</span> xs.min :: ys<span style="color: #ffa500;">)</span>
  <span style="color: #00bfff;">}</span>
  

<span style="color: #ffd700;">}</span>
</pre>
</div>

<p>
Realize that we need some tools to test the efficiency of our codes.
</p>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-org4022953" class="outline-3">
<h3 id="org4022953"><span class="section-number-3">3.2</span> Insertion sort</h3>
</div>
</div>

<div id="outline-container-orgc0fc3da" class="outline-2">
<h2 id="orgc0fc3da"><span class="section-number-2">4</span> Algorithms in <i>C++</i></h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd812653" class="outline-3">
<h3 id="orgd812653"><span class="section-number-3">4.1</span> Selection sort</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Since we have get tailrec form, we can easily convert the algorithm into loops.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-01-28 周二 00:00</p>
<p class="author">Author: Comcx</p>
<p class="date">Created: 2020-01-29 周三 20:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
